Revit 2027 API
DatumExtentType Enumeration
 Represents the type of datum extent that is displayed in a particular view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DatumExtentType
Public Enumeration DatumExtentType
public enum class DatumExtentType
type DatumExtentType
Members
Member name | Value | Description
Model | 0 |  The extent represents the actual 3D extent of the datum plane.
ViewSpecific | 1 |  The extent displayed is specific to the view and does not represent the actual 3D extent of the datum plane.
See Also
Reference
Autodesk.Revit.DB Namespace